tests/data/opsm_sscc_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:typ="http://xmlns.oracle.com/apps/pas/transactions/transactionsService/applicationModule/common/types/"
                  xmlns:com="http://xmlns.oracle.com/apps/pas/transactions/transactionsService/view/common/">
    <soapenv:Header>
    	<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken>
				<wsse:Username>testuser</wsse:Username>
				<wsse:Password>unittest</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <typ:createProcessSerialGenerationRequest>
            <typ:serialGenerationRequest>
                <!--Optional:-->
                <com:SerialQuantity>20</com:SerialQuantity>
                <!--Optional:-->
                <com:Location>031300000770000001-SSCC</com:Location>
                <!--Optional:-->
                <com:Gtin></com:Gtin>
            </typ:serialGenerationRequest>
        </typ:createProcessSerialGenerationRequest>
    </soapenv:Body>
</soapenv:Envelope>
